Repository: leoberbert/tac-writer
Catalog: po/*.po
Languages: pt

source: Please install: python3-gi python3-gi-cairo gir1.2-gtk-4.0 gir1.2-adwaita-1
pt: Por favor, instale: python3-gi python3-gi-cairo gir1.2-gtk-4.0 gir1.2-adwaita-1

source: Error: GTK 4.0 or higher is required
pt: Erro: GTK 4.0 ou superior é necessário

source: Error: Required dependencies not found: {}
pt: Erro: Dependências obrigatórias não encontradas: {}

source: Application interrupted by user.
pt: Aplicativo interrompido pelo usuário.

source: Error checking dependencies: {}
pt: Erro ao verificar dependências: {}

source: Critical error during startup: {}
pt: Erro crítico durante a inicialização: {}

source: PyGTKSpellcheck not installed - disabling spell checking
pt: PyGTKSpellcheck não instalado - desativando verificação ortográfica

source: Enchant backend not available - disabling spell checking
pt: Backend Enchant não disponível - desativando verificação ortográfica

source: No config available for spell check debug
pt: Nenhuma configuração disponível para depuração de verificação ortográfica

source: No spell check dictionaries found - disabling spell checking
pt: Nenhum dicionário de verificação ortográfica encontrado - desativando a verificação ortográfica

source: Main window presented
pt: Janela principal apresentada

source: Application shutdown complete
pt: Encerramento do aplicativo concluído

source: Main window created
pt: Janela principal criada

source: Configuration saved
pt: Configuração salva

source: Import error while checking spell dependencies: {}
pt: Erro de importação ao verificar as dependências de ortografia: {}

source: Unexpected error checking spell dependencies: {}
pt: Erro inesperado ao verificar dependências de feitiços: {}

source: Error during application startup: {}: {}
pt: Erro durante a inicialização do aplicativo: {}: {}

source: Error activating application: {}: {}
pt: Erro ao ativar o aplicativo: {}: {}

source: Error setting up actions: {}: {}
pt: Erro ao configurar ações: {}: {}

source: Error setting up menu: {}: {}
pt: Erro ao configurar o menu: {}: {}

source: Error setting up theme: {}: {}
pt: Erro ao configurar o tema: {}: {}

source: Error showing new project dialog: {}: {}
pt: Erro ao exibir o diálogo de novo projeto: {}: {}

source: Error showing open project dialog: {}: {}
pt: Erro ao mostrar o diálogo de projeto aberto: {}: {}

source: Error saving project: {}: {}
pt: Erro ao salvar o projeto: {}: {}

source: Error showing export dialog: {}: {}
pt: Erro ao mostrar o diálogo de exportação: {}: {}

source: Error showing preferences dialog: {}: {}
pt: Erro ao mostrar o diálogo de preferências: {}: {}

source: Error showing about dialog: {}: {}
pt: Erro ao exibir o diálogo sobre: {}: {}

source: Error opening AI assistant: {}: {}
pt: Erro ao abrir o assistente de IA: {}: {}

source: Error quitting application: {}: {}
pt: Erro ao sair do aplicativo: {}: {}

source: Error during shutdown: {}: {}
pt: Erro durante o desligamento: {}: {}

source: Custom icons loaded with priority: {}
pt: Ícones personalizados carregados com prioridade: {}

source: Warning: Could not setup icon theme: {}
pt: Aviso: Não foi possível configurar o tema de ícones: {}

source: Could not apply CSS: {}
pt: Não foi possível aplicar o CSS: {}

source: Warning: Could not set system locale: {}
pt: Aviso: Não foi possível definir o locale do sistema: {}

source: Gemini did not return any usable content.
pt: O Gemini não retornou nenhum conteúdo utilizável.

source: Unknown error.
pt: Erro desconhecido.

source: Select an AI provider in Preferences ▸ AI Assistant.
pt: Selecione um provedor de IA em Preferências ▸ Assistente de IA.

source: Configure the Gemini API key in Preferences.
pt: Configure a chave da API Gemini nas Preferências.

source: Configure the OpenRouter API key in Preferences.
pt: Configure a chave da API OpenRouter nas Preferências.

source: The AI provider returned an empty response.
pt: O provedor de IA retornou uma resposta vazia.

source: The AI provider did not return any usable content.
pt: O provedor de IA não retornou nenhum conteúdo utilizável.

source: OpenRouter respondeu com HTTP {status}: {message}{detail}
pt: OpenRouter responded with HTTP {status}: {message}{detail}

source: The AI assistant is already processing another request.
pt: O assistente de IA já está processando outra solicitação.

source: Provider '{provider}' is not supported.
pt: O provedor '{provider}' não é suportado.

source: Gemini returned an invalid JSON response.
pt: O Gemini retornou uma resposta JSON inválida.

source: AI provider returned an invalid JSON response.
pt: O provedor de IA retornou uma resposta JSON inválida.

source: OpenRouter respondeu com HTTP {status}: {message}
pt: OpenRouter responded with HTTP {status}: {message}

source: Não foi possível extrair texto do PDF (pode ser uma imagem ou vazio).
pt: Unable to extract text from PDF (it may be an image or empty).

source: Gemini responded with HTTP {status}: {detail}
pt: O Gemini respondeu com HTTP {status}: {detail}

source: AI assistant error: {error}
pt: Erro do assistente de IA: {error}

source: Failed to contact Gemini: {error}
pt: Falha ao contatar o Gemini: {error}

source: Failed to contact OpenRouter: {error}
pt: Falha ao contatar o OpenRouter: {error}

source: Academic Essay
pt: Ensaio Acadêmico

source: Standard academic essay structure
pt: Estrutura padrão de ensaio acadêmico

source: Warning: ODT export not available (missing xml dependencies)
pt: Aviso: Exportação ODT não disponível (dependências XML ausentes)

source: Warning: PDF export not available (missing reportlab)
pt: Aviso: exportação de PDF não disponível (reportlab ausente)

source: ProjectManager initialized with database: {}
pt: GerenciadorDeProjetos inicializado com banco de dados: {}

source: Migration aborted: Could not create backup
pt: Migração abortada: Não foi possível criar backup

source: No valid projects to migrate
pt: Nenhum projeto válido para migrar

source: Database maintenance completed
pt: Manutenção do banco de dados concluída

source: Failed to save new project to database
pt: Falha ao salvar novo projeto no banco de dados

source: Invalid backup file
pt: Arquivo de backup inválido

source: Created migration backup: {}
pt: Backup de migração criado: {}

source: Found {} old JSON projects. Starting migration...
pt: Encontrados {} projetos JSON antigos. Iniciando migração...

source: Migration complete. {} projects successfully migrated.
pt: Migração concluída. {} projetos migrados com sucesso.

source: Database backup created: {}
pt: Backup do banco de dados criado: {}

source: Manual backup created: {}
pt: Backup manual criado: {}

source: Footnotes:
pt: Notas de rodapé:

source: Database connection error: {}
pt: Erro de conexão com o banco de dados: {}

source: Error checking project existence: {}
pt: Erro ao verificar a existência do projeto: {}

source: Invalid project data: missing field '{}'
pt: Dados do projeto inválidos: campo '{}' ausente

source: Failed to create migration backup: {}
pt: Falha ao criar backup de migração: {}

source: Warning: {} files have validation errors and will be skipped
pt: Aviso: {} arquivos têm erros de validação e serão ignorados

source: Migration transaction committed successfully
pt: Transação de migração concluída com sucesso

source: Database error saving project {}: {}
pt: Erro de banco de dados ao salvar o projeto {}: {}

source: Database connection error for project '{}': {}
pt: Erro de conexão com o banco de dados para o projeto '{}': {}

source: Unexpected error in save_project for '{}': {}: {}
pt: Erro inesperado ao salvar_projeto para '{}': {}: {}

source: Warning: Database backup failed: {}
pt: Aviso: Falha no backup do banco de dados: {}

source: Removed old backup: {}
pt: Removido backup antigo: {}

source: Warning: Cleanup of old backups failed: {}
pt: Aviso: A limpeza de backups antigos falhou: {}

source: Database error listing projects: {}
pt: Erro de banco de dados ao listar projetos: {}

source: Unexpected error listing projects: {}: {}
pt: Erro inesperado ao listar projetos: {}: {}

source: Database maintenance failed: {}
pt: A manutenção do banco de dados falhou: {}

source: error: {}
pt: erro: {}

source: unexpected error: {}
pt: erro inesperado: {}

source: Database initialization error: {}
pt: Erro de inicialização do banco de dados: {}

source: Created project: {} ({})
pt: Projeto criado: {} ({})

source: Error creating project: {}: {}
pt: Erro ao criar projeto: {}: {}

source: Loaded project from database: {}
pt: Projeto carregado do banco de dados: {}

source: Database error loading project: {}
pt: Erro de banco de dados ao carregar o projeto: {}

source: Data error loading project: {}: {}
pt: Erro de dados ao carregar o projeto: {}: {}

source: Unexpected error loading project: {}: {}
pt: Erro inesperado ao carregar o projeto: {}: {}

source: Deleted project from database: {}
pt: Projeto excluído do banco de dados: {}

source: Database error deleting project: {}
pt: Erro de banco de dados ao excluir o projeto: {}

source: Error creating manual backup: {}
pt: Erro ao criar backup manual: {}

source: Error listing backups: {}
pt: Erro ao listar backups: {}

source: Backup validation error: {}
pt: Erro de validação de backup: {}

source: Current database backed up to: {}
pt: Banco de dados atual salvo em: {}

source: Import failed, restored previous database
pt: Importação falhou, banco de dados anterior restaurado

source: Error importing database: {}: {}
pt: Erro ao importar o banco de dados: {}: {}

source: Deleted backup: {}
pt: Backup excluído: {}

source: Error deleting backup: {}
pt: Erro ao excluir backup: {}

source: Error exporting project: {}: {}
pt: Erro ao exportar projeto: {}: {}

source: File error exporting to TXT: {}
pt: Erro de arquivo ao exportar para TXT: {}

source: Unexpected error exporting to TXT: {}: {}
pt: Erro inesperado ao exportar para TXT: {}: {}

source: File error exporting to ODT: {}
pt: Erro de arquivo ao exportar para ODT: {}

source: Unexpected error exporting to ODT: {}: {}
pt: Erro inesperado ao exportar para ODT: {}: {}

source: File error exporting to PDF: {}
pt: Erro de arquivo ao exportar para PDF: {}

source: Unexpected error exporting to PDF: {}: {}
pt: Erro inesperado ao exportar para PDF: {}: {}

source: Migration failed with database error: {}
pt: A migração falhou com erro de banco de dados: {}

source: JSON serialization error for project {}: {}
pt: Erro de serialização JSON para o projeto {}: {}

source: Project with ID {} not found in database.
pt: Projeto com ID {} não encontrado no banco de dados.

source: Successfully imported database with {} projects
pt: Banco de dados importado com sucesso com {} projetos

source: Invalid paragraph {}: missing field '{}'
pt: Parágrafo inválido {}: campo '{}' ausente

source: Error loading {}: {}
pt: Erro ao carregar {}: {}

source: JSON serialization error for paragraph {}: {}
pt: Erro de serialização JSON para o parágrafo {}: {}

source: Saved project to database: {}
pt: Projeto salvo no banco de dados: {}

source: Failed to save project to database: {}
pt: Falha ao salvar o projeto no banco de dados: {}

source: Database error saving project '{}': {}
pt: Erro de banco de dados ao salvar o projeto '{}': {}

source: Unexpected error saving project '{}': {}: {}
pt: Erro inesperado ao salvar o projeto '{}': {}: {}

source: Error reading backup file {}: {}
pt: Erro ao ler o arquivo de backup {}: {}

source: Export format '{}' not available
pt: Formato de exportação '{}' não disponível

source: Failed to migrate {} projects
pt: Falha ao migrar {} projetos

source: Migration failed, transaction rolled back: {}
pt: Migração falhou, transação revertida: {}

source: Warning: Could not rename {}: {}
pt: Aviso: Não foi possível renomear {}: {}

source: Error adding image to PDF: {}
pt: Erro ao adicionar imagem ao PDF: {}

source: TAC - Continuous Argumentation Technique
pt: TAC - Técnica de Argumentação Contínua

source: New Project (Ctrl+N)
pt: Novo Projeto (Ctrl+N)

source: Pomodoro Timer
pt: Temporizador Pomodoro

source: Main Menu
pt: Menu Principal

source: Save Project (Ctrl+S)
pt: Salvar Projeto (Ctrl+S)

source: Ask AI Assistant (Ctrl+Shift+I)
pt: Perguntar ao Assistente de IA (Ctrl+Shift+I)

source: Search...
pt: Pesquisar...

source: Find next occurrence
pt: Encontrar próxima ocorrência

source: Export Project...
pt: Exportar Projeto...

source: Backup Manager...
pt: Gerenciador de Backup...

source: Undo
pt: Desfazer

source: Redo
pt: Refazer

source: Preferences
pt: Preferências

source: Welcome Guide
pt: Guia de Boas-Vindas

source: Ask AI Assistant
pt: Perguntar ao Assistente de IA

source: About TAC
pt: Sobre o TAC

source: Projects
pt: Projetos

source: Add Paragraph
pt: Adicionar Parágrafo

source: Insert Image
pt: Inserir Imagem

source: Insert Image (Ctrl+Alt+I)
pt: Inserir Imagem (Ctrl+Alt+I)

source: Go to beginning
pt: Ir para o início

source: Go to end
pt: Ir para o final

source: Edit Image
pt: Editar Imagem

source: Remove Image
pt: Remover Imagem

source: Remove Image?
pt: Remover Imagem?

source: Are you sure you want to remove this image from the document?
pt: Você tem certeza de que deseja remover esta imagem do documento?

source: Cancel
pt: Cancelar

source: Remove
pt: Remover

source: Nothing to undo
pt: Nada para desfazer

source: Nothing to redo
pt: Nada para refazer

source: Paragraph reordered
pt: Parágrafo reordenado

source: Open Project
pt: Abrir Projeto

source: Open
pt: Abrir

source: TAC Projects (*.json)
pt: Projetos TAC (*.json)

source: All Files
pt: Todos os Arquivos

source: Database imported successfully
pt: Banco de dados importado com sucesso

source: Click here to start writing! Add paragraphs to build your text.
pt: Clique aqui para começar a escrever! Adicione parágrafos para construir seu texto.

source: Got it!
pt: Entendi!

source: Close
pt: Fechar

source: Response
pt: Resposta

source: Copied to clipboard.
pt: Copiado para a área de transferência.

source: Text inserted into the document.
pt: Texto inserido no documento.

source: Paragraph updated with AI suggestion.
pt: Parágrafo atualizado com sugestão de IA.

source: Reached the end of the document.
pt: Chegou ao final do documento.

source: Analysis Failure
pt: Falha na Análise

source: Title 1
pt: Título 1

source: Title 2
pt: Título 2

source: Introduction
pt: Introdução

source: Argument
pt: Argumento

source: Argument Resumption
pt: Retomada de Argumento

source: Quote
pt: Citação

source: Epigraph
pt: Epígrafe

source: Conclusion
pt: Conclusão

source: Image updated
pt: Imagem atualizada

source: No project open
pt: Nenhum projeto aberto

source: Project saved successfully
pt: Projeto salvo com sucesso

source: Failed to save project
pt: Falha ao salvar o projeto

source: Auto-save failed
pt: Falha ao salvar automaticamente

source: No project to export
pt: Nenhum projeto para exportar

source: Enable the AI assistant in Preferences ▸ AI Assistant.
pt: Ativar o assistente de IA em Preferências ▸ Assistente de IA.

source: Provider
pt: Provedor

source: API key
pt: chave da API

source: Enable AI in Preferences. API key is required. Read Wiki if there is any doubt.
pt: Ativar IA nas Preferências. A chave da API é necessária. Leia a Wiki se houver alguma dúvida.

source: AI Assistant
pt: Assistente de IA

source: Here is the assistant's suggestion.
pt: Aqui está a sugestão do assistente.

source: Copy to clipboard
pt: Copiar para a área de transferência

source: Insert at cursor
pt: Inserir no cursor

source: Apply correction
pt: Aplicar correção

source: Additional suggestions
pt: Sugestões adicionais

source: Place the cursor inside a paragraph to insert the text.
pt: Coloque o cursor dentro de um parágrafo para inserir o texto.

source: Nothing to insert.
pt: Nada para inserir.

source: No paragraph context available. Try inserting at the cursor.
pt: Nenhum contexto de parágrafo disponível. Tente inserir no cursor.

source: Could not determine the original paragraph.
pt: Não foi possível determinar o parágrafo original.

source: Enter text to search.
pt: Digite o texto para pesquisar.

source: No matches found.
pt: Nenhum resultado encontrado.

source: No editable paragraphs available.
pt: Nenhum parágrafo editável disponível.

source: Continuous Argumentation Technique
pt: Técnica de Argumentação Contínua

source: Loading project...
pt: Carregando projeto...

source: Failed to open project
pt: Falha ao abrir o projeto

source: ⚠️ Error: Invalid image data
pt: ⚠️ Erro: Dados de imagem inválidos

source: Error updating image
pt: Erro ao atualizar a imagem

source: Created project: {}
pt: Projeto criado: {}

source: Image inserted successfully
pt: Imagem inserida com sucesso

source: Error inserting image
pt: Erro ao inserir imagem

source: Please enter a question for the assistant.
pt: Por favor, insira uma pergunta para o assistente.

source: The AI assistant is processing your request...
pt: O assistente de IA está processando sua solicitação...

source: Image removed
pt: Imagem removida

source: Configure {items} in Preferences ▸ AI Assistant.
pt: Configurar {items} em Preferências ▸ Assistente de IA.

source: Failed to open project: {}
pt: Falha ao abrir o projeto: {}

source: Opened project: {}
pt: Projeto aberto: {}

source: Error removing image
pt: Erro ao remover imagem

source: ⚠️ Image not found: {}
pt: ⚠️ Imagem não encontrada: {}

source: ⚠️ Error loading image: {}
pt: ⚠️ Erro ao carregar a imagem: {}

source: Minimize
pt: Minimizar

source: Create structured academic texts with guided paragraph types
pt: Crie textos acadêmicos estruturados com tipos de parágrafo guiados

source: How To Wiki
pt: Como Fazer Wiki

source: Access the online documentation and tutorials
pt: Acesse a documentação online e os tutoriais

source: Start Writing
pt: Começar a Escrever

source: Choose a template to get started
pt: Escolha um modelo para começar

source: Search projects...
pt: Pesquisar projetos...

source: Rename project
pt: Renomear projeto

source: Delete project
pt: Excluir projeto

source: Rename Project
pt: Renomear Projeto

source: Rename
pt: Renomear

source: This project will be moved to trash and can be recovered.
pt: Este projeto será movido para a lixeira e pode ser recuperado.

source: Delete
pt: Excluir

source: Remove paragraph
pt: Remover parágrafo

source: Paragraph
pt: Parágrafo

source: Remove Paragraph?
pt: Remover Parágrafo?

source: This action cannot be undone.
pt: Esta ação não pode ser desfeita.

source: Manage Footnotes
pt: Gerenciar Notas de Rodapé

source: Save
pt: Salvar

source: Add footnotes that will appear as numbered references in your paragraph:
pt: Adicione notas de rodapé que aparecerão como referências numeradas em seu parágrafo:

source: Add Footnote
pt: Adicionar Nota de Rodapé

source: Enter footnote text...
pt: Digite o texto da nota de rodapé...

source: Reset
pt: Redefinir

source: ⏸ Pause
pt: ⏸ Pausar

source: ▶ Start
pt: ▶ Iniciar

source: Start
pt: Iniciar

source: Manage footnotes
pt: Gerenciar notas de rodapé

source: Toggle spell checking
pt: Ativar verificação ortográfica

source: Welcome to TAC Writer!
pt: Bem-vindo ao TAC Writer!

source: Let's take a quick tour. Click here to create your first project and start writing.
pt: Vamos fazer um rápido tour. Clique aqui para criar seu primeiro projeto e começar a escrever.

source: Project Library
pt: Biblioteca de Projetos

source: All your projects are listed here. You can search, rename, or delete them at any time.
pt: Todos os seus projetos estão listados aqui. Você pode pesquisar, renomear ou excluí-los a qualquer momento.

source: Stay focused with the built-in Pomodoro timer. Perfect for writing sessions!
pt: Mantenha o foco com o temporizador Pomodoro embutido. Perfeito para sessões de escrita!

source: Use AI to revise your exported text. Configure in Preferences. Read wiki for guided configuration.
pt: Use IA para revisar seu texto exportado. Configure em Preferências. Leia a wiki para configuração guiada.

source: Save Your Work
pt: Salve seu trabalho

source: Don't worry! Auto-save is enabled by default, but you can also save manually here.
pt: Não se preocupe! A salvaguarda automática está ativada por padrão, mas você também pode salvar manualmente aqui.

source: Skip Tour
pt: Pular Tour

source: Previous
pt: Anterior

source: Next
pt: Próximo

source: Finish
pt: Concluir

source: Long Break
pt: Longa Pausa

source: Rest Time
pt: Tempo de Descanso

source: Welcome to TAC
pt: Bem-vindo ao TAC

source: exporting to ODT might require some adjustment in your Office Suite.
pt: exportar para ODT pode exigir alguns ajustes na sua suíte de escritório.

source: Enter new name for '{}'
pt: Digite um novo nome para '{}'

source: Delete '{}'?
pt: Excluir '{}' ?

source: {count} words
pt: {count} palavras

source: 1 footnote
pt: 1 nota de rodapé

source: Session {}
pt: Sessão {}

source: Error setting up Pomodoro dialog styles: {}
pt: Erro ao configurar os estilos do diálogo Pomodoro: {}

source: Note:
pt: Nota:

source: {} footnotes
pt: {} notas de rodapé

source: Error setting up spell check: {}
pt: Erro ao configurar a verificação ortográfica: {}

source: Could not open wiki URL: {}
pt: Não foi possível abrir a URL da wiki: {}

source: Error toggling spell check: {}
pt: Erro ao alternar a verificação ortográfica: {}

source: New Project
pt: Novo Projeto

source: Create
pt: Criar

source: Project Details
pt: Detalhes do Projeto

source: Project Name
pt: Nome do Projeto

source: Enter project name...
pt: Digite o nome do projeto...

source: My New Project
pt: Meu Novo Projeto

source: Author
pt: Autor

source: Your name...
pt: Seu nome...

source: Description
pt: Descrição

source: Template
pt: Modelo

source: Choose a template to start with
pt: Escolha um modelo para começar.

source: Document Template
pt: Modelo de Documento

source: Export Project
pt: Exportar Projeto

source: Export
pt: Exportar

source: Project Information
pt: Informações do Projeto

source: Statistics
pt: Estatísticas

source: Export Options
pt: Opções de Exportação

source: Format
pt: Formato

source: Include Metadata
pt: Incluir Metadados

source: Include author, creation date, and other project information
pt: Incluir autor, data de criação e outras informações do projeto

source: Output Location
pt: Local de Saída

source: Save Location
pt: Local de Salvamento

source: Click to choose location
pt: Clique para escolher a localização

source: Choose...
pt: Escolher...

source: Choose Export Location
pt: Escolher Local de Exportação

source: Select
pt: Selecionar

source: Exporting...
pt: Exportando...

source: General
pt: Geral

source: Appearance
pt: Aparência

source: Dark Theme
pt: Tema Escuro

source: Use dark theme for the application
pt: Use o tema escuro para o aplicativo

source: Behavior
pt: Comportamento

source: Auto Save
pt: Salvar Automaticamente

source: Automatically save projects while editing
pt: Salvar projetos automaticamente durante a edição

source: Word Wrap
pt: Quebra de linha

source: Wrap text to fit the editor width
pt: Quebrar texto para caber na largura do editor

source: Show Line Numbers
pt: Mostrar Números de Linha

source: Display line numbers in the editor
pt: Exibir números de linha no editor

source: Assistant Settings
pt: Configurações do Assistente

source: Configure the provider and credentials used to generate suggestions.
pt: Configurar o provedor e as credenciais usadas para gerar sugestões.
