Repository: leoberbert/tac-writer
Catalog: po/*.po
Languages: pt

source: Tac Writer is a tool based on the TAC technique (Continued Argumentation Technique) and the Pomodoro method. TAC technique helps writers develop an idea in an organized manner, separating the paragraph into different stages. Read wiki to take advantage of all the resources. To open wiki click on '?' icon
pt: Tac Writer é uma ferramenta baseada na técnica TAC (Técnica de Argumentação Contínua) e no método Pomodoro. A técnica TAC ajuda os escritores a desenvolver uma ideia de maneira organizada, separando o parágrafo em diferentes etapas. Leia a wiki para aproveitar todos os recursos. Para abrir a wiki, clique no ícone '?'.

source: Learn More - Online Documentation
pt: Saiba Mais - Documentação Online

source: Access the complete guide and tutorials
pt: Acesse o guia completo e os tutoriais

source: Show this dialog on startup
pt: Mostrar este diálogo na inicialização

source: Let's Start
pt: Vamos Começar

source: Backup Manager
pt: Gerenciador de Backup

source: Create Backup
pt: Criar Backup

source: Import Database
pt: Importar Banco de Dados

source: Current Database
pt: Banco de Dados Atual

source: Database Location
pt: Localização do Banco de Dados

source: Available Backups
pt: Backups Disponíveis

source: Backups are stored in Documents/TAC Projects/database_backups
pt: Os backups são armazenados em Documentos/Projetos TAC/backup_do_banco_de_dados

source: Delete backup
pt: Excluir backup

source: Creating...
pt: Criando...

source: Database files (*.db)
pt: Arquivos de banco de dados (*.db)

source: All files
pt: Todos os arquivos

source: Import Database?
pt: Importar Banco de Dados?

source: Import
pt: Importar

source: Importing Database
pt: Importando Banco de Dados

source: Please wait while the database is being imported...
pt: Aguarde enquanto o banco de dados está sendo importado...

source: Delete Backup?
pt: Excluir Backup?

source: Update
pt: Atualizar

source: Insert
pt: Inserir

source: Image File
pt: Arquivo de Imagem

source: Select an image file to insert into your document
pt: Selecione um arquivo de imagem para inserir em seu documento

source: Select Image
pt: Selecionar Imagem

source: Image Formatting
pt: Formatação de Imagem

source: Display Width (%)
pt: Largura da Exibição (%)

source: Percentage of page width
pt: Porcentagem da largura da página

source: Alignment
pt: Alinhamento

source: Image position on the page
pt: Posição da imagem na página

source: Caption (optional)
pt: Legenda (opcional)

source: Alternative Text (optional)
pt: Texto Alternativo (opcional)

source: Position in Document
pt: Posição no Documento

source: Insert After
pt: Inserir Depois

source: Choose where to place the image
pt: Escolha onde colocar a imagem

source: Beginning of document
pt: Início do documento

source: Image Files
pt: Arquivos de Imagem

source: PDF Review by AI
pt: Revisão de PDF por IA

source: Select PDF
pt: Selecionar PDF

source: Analysis Results
pt: Resultados da Análise

source: Export Successful
pt: Exportação bem-sucedida

source: An error occurred while exporting the project.
pt: Ocorreu um erro ao exportar o projeto.

source: Export Failed
pt: Exportação Falhou

source: Enable AI Assistant
pt: Ativar Assistente de IA

source: Allow prompts to use an external provider (Ctrl+Shift+I).
pt: Permitir que os prompts usem um provedor externo (Ctrl+Shift+I).

source: Model Identifier
pt: Identificador do Modelo

source: API Key
pt: Chave da API

source: Stored locally and used to authenticate requests.
pt: Armazenado localmente e usado para autenticar solicitações.

source: Paste your API key
pt: Cole seu chave da API

source: Gemini model identifier (for example: gemini-2.5-flash).
pt: Identificador do modelo Gemini (por exemplo: gemini-2.5-flash).

source: Google AI Studio API key.
pt: Chave da API do Google AI Studio.

source: {} projects, {} MB
pt: {} projetos, {} MB

source: No backups found
pt: Nenhum backup encontrado

source: Create a backup or import an existing database file
pt: Criar um backup ou importar um arquivo de banco de dados existente

source: {:.1f} MB • {} projects • {}
pt: {:.1f} MB • {} projetos • {}

source: Valid backup
pt: Backup válido

source: Invalid or corrupted backup
pt: Backup inválido ou corrompido

source: Import this backup
pt: Importar este backup

source: Backup Failed
pt: Backup Falhou

source: Could not create backup. Check the console for details.
pt: Não foi possível criar o backup. Verifique o console para mais detalhes.

source: Import Successful
pt: Importação bem-sucedida

source: Database imported successfully. The application will refresh to show the imported projects.
pt: Banco de dados importado com sucesso. O aplicativo será atualizado para mostrar os projetos importados.

source: Import Failed
pt: Importação Falhou

source: Could not import the database. Your current database remains unchanged.
pt: Não foi possível importar o banco de dados. Seu banco de dados atual permanece inalterado.

source: No file selected
pt: Nenhum arquivo selecionado

source: Browse...
pt: Navegar...

source: Left
pt: Esquerda

source: Center
pt: Centro

source: Right
pt: Direita

source: Select a PDF file of your text for review. The AI ​​will perform a spelling, grammar, and semantic analysis. IMPORTANT: Consider the 10,000 character limit for free APIs. Splitting your text into multiple files may be an alternative to paid API.
pt: Selecione um arquivo PDF do seu texto para revisão. A IA realizará uma análise de ortografia, gramática e semântica. IMPORTANTE: Considere o limite de 10.000 caracteres para APIs gratuitas. Dividir seu texto em vários arquivos pode ser uma alternativa à API paga.

source: Choose PDF...
pt: Escolher PDF...

source: Run Analysis
pt: Executar Análise

source: Analyzing (may take a few minutes)
pt: Analisando (pode levar alguns minutos)

source: Project name cannot be empty
pt: O nome do projeto não pode estar vazio

source: Project name is too long (max 100 characters)
pt: O nome do projeto é muito longo (máx. 100 caracteres)

source: Failed to save project to database
pt: Falha ao salvar o projeto no banco de dados

source: Invalid Input
pt: Entrada Inválida

source: Error Creating Project
pt: Erro ao Criar Projeto

source: Unexpected Error
pt: Erro Inesperado

source: {} words, {} paragraphs
pt: {} palavras, {} parágrafos

source: OpenRouter model identifier (for example: x-ai/grok-4.1-fast:free).
pt: Identificador do modelo OpenRouter (por exemplo: x-ai/grok-4.1-fast:free).

source: OpenRouter API key.
pt: Chave da API do OpenRouter.

source: model-name
pt: nome-do-modelo

source: Model identifier required by the selected provider.
pt: Identificador do modelo necessário pelo provedor selecionado.

source: API key used to authenticate requests.
pt: Chave da API usada para autenticar solicitações.

source: What is TAC Writer?
pt: O que é o TAC Writer?

source: Continuous Argumentation Technique (TAC in Portuguese):
pt: Técnica de Argumentação Contínua (TAC em português):

source: Backup created successfully
pt: Backup criado com sucesso

source: Invalid Backup
pt: Backup Inválido

source: The selected file is not a valid TAC database backup.
pt: O arquivo selecionado não é um backup válido do banco de dados TAC.

source: This will replace your current database with the selected backup. The backup contains {} projects. Your current database will be backed up before importing.
pt: Isso substituirá seu banco de dados atual pelo backup selecionado. O backup contém {} projetos. Seu banco de dados atual será salvo antes da importação.

source: Are you sure you want to delete '{}'? This action cannot be undone.
pt: Você tem certeza de que deseja excluir '{}'? Esta ação não pode ser desfeita.

source: Preview
pt: Prévia

source: Error Loading Image
pt: Erro ao Carregar Imagem

source: Project exported to: {}
pt: Projeto exportado para: {}

source: Size: {} x {} pixels • {:.1f} KB
pt: Tamanho: {} x {} pixels • {:.1f} KB

source: An unexpected error occurred. Please report this issue:
pt: Ocorreu um erro inesperado. Por favor, reporte este problema:

source: Warning: Could not create default export directory: {}
pt: Aviso: Não foi possível criar o diretório de exportação padrão: {}

source: Error loading preferences: {}
pt: Erro ao carregar preferências: {}

source: Error changing theme: {}
pt: Erro ao mudar o tema: {}

source: Error changing font family: {}
pt: Erro ao alterar a família da fonte: {}

source: Error changing font size: {}
pt: Erro ao alterar o tamanho da fonte: {}

source: Error changing auto save: {}
pt: Erro ao alterar a salvaguarda automática: {}

source: Error changing word wrap: {}
pt: Erro ao alterar a quebra de linha: {}

source: Error changing line numbers: {}
pt: Erro ao alterar os números das linhas: {}

source: Error applying welcome dialog CSS: {}
pt: Erro ao aplicar o CSS do diálogo de boas-vindas: {}

source: Error saving welcome dialog preference: {}
pt: Erro ao salvar a preferência do diálogo de boas-vindas: {}

source: Error getting database info: {}
pt: Erro ao obter informações do banco de dados: {}

source: Error validating backup: {}
pt: Erro ao validar o backup: {}

source: Error reading backup info: {}
pt: Erro ao ler informações de backup: {}

source: (empty)
pt: ( vazio )

source: Error selecting file: {}
pt: Erro ao selecionar o arquivo: {}

source: Error loading image: {}
pt: Erro ao carregar a imagem: {}

source: Could not load the selected image file.
pt: Não foi possível carregar o arquivo de imagem selecionado.

source: Error loading existing image: {}
pt: Erro ao carregar a imagem existente: {}

source: Error in backup thread: {}
pt: Erro na thread de backup: {}

source: Error in import thread: {}
pt: Erro na thread de importação: {}

source: Image
pt: Imagem

source: Could not {} the image.
pt: Não foi possível {} a imagem.

source: update
pt: atualizar

source: insert
pt: inserir

source: 0 minutes
pt: 0 minutos

source: < 1 minute
pt: < 1 minuto

source: 1 paragraph
pt: 1 parágrafo

source: 1 word
pt: chave

source: Methods:
pt: Métodos:

source: Unknown
pt: Desconhecido

source: Project name must be at least 2 characters long
pt: O nome do projeto deve ter pelo menos 2 caracteres.

source: Project name cannot exceed 100 characters
pt: O nome do projeto não pode exceder 100 caracteres

source: Project name contains invalid characters
pt: O nome do projeto contém caracteres inválidos

source: Path cannot be empty
pt: O caminho não pode estar vazio

source: Attributes:
pt: Atributos:

source: 1 minute
pt: 1 minuto

source: Parent directory does not exist
pt: O diretório pai não existe

source: Path is too long
pt: O caminho é muito longo

source: {count} paragraphs
pt: {count} parágrafos

source: Info
pt: Informação

source: Type: {}
pt: Tipo: {}

source: Module: {}
pt: Módulo: {}

source: Performance: {} took {:.3f} seconds
pt: Desempenho: {} levou {:.3f} segundos

source: ... and {} more methods
pt: ... e {} métodos adicionais

source: {} minutes
pt: {} minutos

source: Invalid path: {}
pt: Caminho inválido: {}

source: {:,} words
pt: {: ,} palavras

source: {:,} characters
pt: {:,} caracteres
